Revit 2016 API
RenderingQuality Enumeration
 Indicates the rendering quality in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public enum RenderingQuality
Visual Basic
Public Enumeration RenderingQuality
Visual C++
public enum class RenderingQuality
Members
Member name | Description
Draft |  Draft level quality.
Low |  Low level quality.
Medium |  Medium level quality.
High |  High level quality.
VeryHigh |  Very high level quality.
Custom |  Custom level quality.
See Also
Autodesk.Revit.DB Namespace